app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :conditions => "login <> 'admin' and state <> 'deleted'")
---
SELECT * FROM "users" WHERE (login <> 'admin' and state <> 'deleted')

  def suspend
    user = User.find_by_id(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '999999') LIMIT 1